# Project Title
### Data Engineering Capstone Project

#### Project Summary
--describe your project at a high level--

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [158]:
# Do all imports and installs here
import os
import logging

import pandas as pd
from dotenv import load_dotenv

In [3]:
pd.set_option('display.max_columns', 100)

In [4]:
logging.basicConfig(level='INFO')

In [157]:
load_dotenv('./.env')

True

### Step 1: Scope the Project and Gather Data

#### Scope 
Explain what you plan to do in the project in more detail. What data do you use? What is your end solution look like? What tools did you use? etc>

#### Describe and Gather Data 
Describe the data sets you're using. Where did it come from? What type of information is included?

In [6]:
from lib.extract import Extractor

extractor = Extractor(local=True)

1. I94 Immigration Data

In [7]:
# Read in the data here
immi = extractor.immigration_data()

print(f"Data Dimensions: {immi.shape}")
print(f"DataFrame Memory Usage: {immi.memory_usage().sum()/1000000}MB")
immi.head()

INFO:lib.extract:Fetching data from: ./data/sas_data

Data Dimensions: (3096313, 28)
DataFrame Memory Usage: 693.57424MB

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,6.0,2016.0,4.0,692.0,692.0,XXX,20573.0,NaN,None,NaN,37.0,2.0,1.0,None,None,None,T,None,U,None,1979.0,10282016,None,None,None,1.897628e+09,None,B2
1,7.0,2016.0,4.0,254.0,276.0,ATL,20551.0,1.0,AL,NaN,25.0,3.0,1.0,20130811,SEO,None,G,None,Y,None,1991.0,D/S,M,None,None,3.736796e+09,00296,F1
2,15.0,2016.0,4.0,101.0,101.0,WAS,20545.0,1.0,MI,20691.0,55.0,2.0,1.0,20160401,None,None,T,O,None,M,1961.0,09302016,M,None,OS,6.666432e+08,93,B2
3,16.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,28.0,2.0,1.0,20160401,None,None,O,O,None,M,1988.0,09302016,None,None,AA,9.246846e+10,00199,B2
4,17.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,4.0,2.0,1.0,20160401,None,None,O,O,None,M,2012.0,09302016,None,None,AA,9.246846e+10,00199,B2

2. World Temperature Data by City

In [193]:
temp = extractor.temperature_data()

print(f"Data Dimensions: {temp.shape}")
print(f"DataFrame Memory Usage: {temp.memory_usage().sum()/1000000}MB")
temp.head()

INFO:lib.extract:Fetching data from: ./data/GlobalLandTemperaturesByCity.csv

Data Dimensions: (8599212, 7)
DataFrame Memory Usage: 481.556MB

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

US City Demographic Data

In [215]:
demo = extractor.us_city_demographic_data()

print(f"Data Dimensions: {demo.shape}")
print(f"DataFrame Memory Usage: {demo.memory_usage().sum()/1000000}MB")
demo.head()

INFO:lib.extract:Fetching data from: ./data/us-cities-demographics.csv

Data Dimensions: (2891, 12)
DataFrame Memory Usage: 0.277664MB

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

Airport Codes

In [85]:
airport = extractor.airport_data()

print(f"Data Dimensions: {airport.shape}")
print(f"DataFrame Memory Usage: {airport.memory_usage().sum()/1000000}MB")
airport.head()

INFO:lib.extract:Fetching data from: ./data/airport-codes_csv.csv

Data Dimensions: (55075, 12)
DataFrame Memory Usage: 5.287328MB

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,Bensalem,00A,NaN,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,Leoti,00AA,NaN,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,Anchor Point,00AK,NaN,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,Harvest,00AL,NaN,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,Newport,NaN,NaN,NaN,"-91.254898, 35.6087"

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

In [10]:
from lib.clean import (
    clean_immigration_data,
    clean_temperature_data,
    clean_us_demographic_data,
    clean_airport_data
)

In [46]:
immi = clean_immigration_data(immi)

immi.head()

INFO:lib.clean:Cleaning immigration data...

,immigrant_id,year,month,country_of_citizenship_code,country_of_residence_code,arrival_port_code,arrival_date,departure_date,arrival_mode_code,airline,flight_number,state_settled_code,age,birth_year,visa_code,visa_type,gender,country_of_citizenship,country_of_residence,arrival_port,arrival_mode,state_settled,visa_reason,arrival_port_city,arrival_port_state
0,6,2016,4,692,692,XXX,2016-04-29,NaT,<NA>,None,None,None,37,1979,2,B2,None,ECUADOR,ECUADOR,NOT REPORTED/UNKNOWN,NaN,NaN,Pleasure,NaN,NaN
1,7,2016,4,254,276,ATL,2016-04-07,NaT,1,None,00296,AL,25,1991,3,F1,M,NaN,SOUTH KOREA,"ATLANTA, GA",Air,ALABAMA,Student,ATLANTA,GA
2,15,2016,4,101,101,WAS,2016-04-01,2016-08-25,1,OS,93,MI,55,1961,2,B2,M,ALBANIA,ALBANIA,WASHINGTON DC,Air,MICHIGAN,Pleasure,WASHINGTON,DC
3,16,2016,4,101,101,NYC,2016-04-01,2016-04-23,1,AA,00199,MA,28,1988,2,B2,None,ALBANIA,ALBANIA,"NEW YORK, NY",Air,MASSACHUSETTS,Pleasure,NEW YORK,NY
4,17,2016,4,101,101,NYC,2016-04-01,2016-04-23,1,AA,00199,MA,4,2012,2,B2,None,ALBANIA,ALBANIA,"NEW YORK, NY",Air,MASSACHUSETTS,Pleasure,NEW YORK,NY

In [194]:
temp = clean_temperature_data(temp)

temp.head()

INFO:lib.clean:Cleaning temperature data...

,date,avg_temperature,avg_temperature_uncertainty,city,country,latitude,longitude
0,1743-11-01,6.068,1.737,ÅRHUS,DENMARK,57.05N,10.33E
1,1743-12-01,NaN,NaN,ÅRHUS,DENMARK,57.05N,10.33E
2,1744-01-01,NaN,NaN,ÅRHUS,DENMARK,57.05N,10.33E
3,1744-02-01,NaN,NaN,ÅRHUS,DENMARK,57.05N,10.33E
4,1744-03-01,NaN,NaN,ÅRHUS,DENMARK,57.05N,10.33E

In [216]:
demo = clean_us_demographic_data(demo)

demo.head()

INFO:lib.clean:Cleaning US Demographic data...

,city,state,median_age,male_population,female_population,total_population,no_veterans,is_foreign_born,avg_household_size,state_code,race,count
0,SILVER SPRING,MARYLAND,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,QUINCY,MASSACHUSETTS,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,HOOVER,ALABAMA,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,RANCHO CUCAMONGA,CALIFORNIA,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,NEWARK,NEW JERSEY,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [86]:
airport = clean_airport_data(airport)

airport.head()

INFO:lib.clean:Cleaning airport code data...

,airport_id,type,name,elevation_ft,continent,iso_country_code,iso_region_code,city,gps_code,iata_code,local_code,latitude,longitude
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,BENSALEM,00A,NaN,00A,-74.93360137939453,40.07080078125
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,LEOTI,00AA,NaN,00AA,-101.473911,38.704022
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,ANCHOR POINT,00AK,NaN,00AK,-151.695999146,59.94919968
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,HARVEST,00AL,NaN,00AL,-86.77030181884766,34.86479949951172
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,NEWPORT,NaN,NaN,NaN,-91.254898,35.6087

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
Map out the conceptual data model and explain why you chose that model

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model

### Data Tranformations

In [221]:
from lib.transform import (
    calc_avg_monthly_temp_by_city_and_state,
    agg_airports_by_city_and_state
)

In [212]:
temp = calc_avg_monthly_temp_by_city_and_state(temp, from_s3=True)

temp.head()

  state_code       city  month  avg_temperature  avg_temperature_uncertainty
0         AK  ANCHORAGE      1       -15.194667                     0.818333
1         AK  ANCHORAGE      2        -9.840000                     0.709667
2         AK  ANCHORAGE      3        -9.404667                     0.407000
3         AK  ANCHORAGE      4        -2.468333                     0.537333
4         AK  ANCHORAGE      5         4.616333                     0.641000

In [87]:
airport = agg_airports_by_city_and_state(airport)

airport.head()

,state_code,city,no_airports,avg_elevation,most_common_type
0,AK,ADAK ISLAND,1,18.0,medium_airport
1,AK,AKHIOK,1,44.0,small_airport
2,AK,AKIACHAK,2,11.5,"[seaplane_base, small_airport]"
3,AK,AKIAK,1,30.0,small_airport
4,AK,AKUTAN,2,NaN,"[seaplane_base, small_airport]"

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [257]:
from sqlalchemy import create_engine
# In a real, non-local DB, the connection string should be loaded from environment
# variables for security reasons. 
db_engine = create_engine(f'postgresql+psycopg2://postgres:postgres@localhost:5432/dev')

In [229]:
immi.to_sql(
    'immigration_base', 
    db_engine, 
    if_exists='append',
    chunksize=10000,
    method='multi',
    index=False
)

In [230]:
temp.to_sql(
    'temperatures', 
    db_engine, 
    if_exists='append',
    index=False
)

In [ ]:
demo.to_sql(
    'demographics', 
    db_engine, 
    if_exists='append',
    index=False
)

In [248]:
airport.to_sql(
    'airports', 
    db_engine, 
    if_exists='append',
    index=False
)

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

In [266]:
# Ensure all tables populated
tables = [
    'immigration_base',
    'temperatures',
    'demographics',
    'airports',
    'immigrant_stay_length_by_state',
    'immigrants_by_city',
    'immigrants_by_state'
]
for table in tables:
    results = db_engine.execute(f"""
        SELECT COUNT(*) > 0
        FROM {table}
    """)
    assert results.fetchone()[0] == True

In [274]:
results = db_engine.execute(f"""
    SELECT 
        COUNT(*)/(
            SELECT COUNT(*)
            FROM immigration_base
        )::DECIMAL
    FROM immigration_base
    WHERE departure_date < arrival_date
""")

assert results.fetchone()[0] < .01

True

#### 4.3 Data dictionary 
Create a data dictionary for your data model. For each field, provide a brief description of what the data is and where it came from. You can include the data dictionary in the notebook or in a separate file.

See project README.md

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.
* Propose how often the data should be updated and why.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 * The database needed to be accessed by 100+ people.


See project README.md